docs/snatch_own.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-07 Wed 19:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>snatch_own</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">snatch_own</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1f1436a">NAME</a></li>
<li><a href="#org6143770">SYNOPSIS</a></li>
<li><a href="#orgbbe9296">DESCRIPTION</a>
<ul>
<li><a href="#org9815ce2">Optional Arguments</a></li>
<li><a href="#org1bfab54">Positional Argument</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org1f1436a" class="outline-2">
<h2 id="org1f1436a">NAME</h2>
<div class="outline-text-2" id="text-org1f1436a">
<p>
snatch_own - snatch ownership
</p>
</div>
</div>

<div id="outline-container-org6143770" class="outline-2">
<h2 id="org6143770">SYNOPSIS</h2>
<div class="outline-text-2" id="text-org6143770">
<p>
snatch_own -h
</p>

<p>
snatch_own &#x2013;help
</p>

<p>
snatch_own [-R] [-v] [-u|&#x2013;user ROBBER] [-g|&#x2013;group SYNDICATE] TARGET
</p>
</div>
</div>

<div id="outline-container-orgbbe9296" class="outline-2">
<h2 id="orgbbe9296">DESCRIPTION</h2>
<div class="outline-text-2" id="text-orgbbe9296">
<p>
Snatch Ownership of objects (files/directories). Requires superuser permissions.
</p>
</div>

<div id="outline-container-org9815ce2" class="outline-3">
<h3 id="org9815ce2">Optional Arguments</h3>
<div class="outline-text-3" id="text-org9815ce2">
<p>
-h                          print usage message and exit
</p>

<p>
&#x2013;help                      print this message and exit
</p>

<p>
-R                          apply recursive
</p>

<p>
-v                          verbose outout
</p>

<p>
-u|&#x2013;user ROBBER            give ownership to ROBBER [ default: <code>${USER}</code> ]
</p>

<p>
-g|&#x2013;group SYNDICATE        group ownership [default: ROBBER's primary]
</p>
</div>
</div>

<div id="outline-container-org1bfab54" class="outline-3">
<h3 id="org1bfab54">Positional Argument</h3>
<div class="outline-text-3" id="text-org1bfab54">
<p>
TARGET                      TARGET to be robbed
</p>
</div>
</div>
</div>
</div>
</body>
</html>
